**Analisi dei dati anagrafici dei dipendenti di un'azienda**

In [1]:
import pandas as pd

1. Inserisci in un dataframe il contenuto del file "dipendenti.csv".

   Quante righe e quante colonne ci sono? Ci sono duplicati?

In [31]:
data = pd.DataFrame(pd.read_csv('../data/dipendenti.csv', sep=';'))
data
print(f"Dataframe is: {data.shape}")

Dataframe is: (15, 7)

2. Crea una nuova colonna chiamata **Livello Esperienza**, utilizzando la colonna **Anni di esperienza**. Se l'esperienza è minore di 5 anni, mappa il valore a "Junior", tra 5 e 10 a "Mid" e più di 10 a "Senior".

In [28]:
def find_level(years):
    if years < 5:
        return 'Junior'
    elif years < 10:
        return 'Mid'
    else:
        return 'Senior'
    
# data.insert(len(data.columns),'Livello Esperienza', data['Anni di esperienza'].map(find_level), True)
data['Livello Esperienza'] = data['Anni di esperienza'].map(find_level)
data

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città,Livello Esperienza
0,Marco,Rossi,NaN,2,Vendite,30000,Milano,Junior
1,Anna,Bianchi,32.0,7,Information Technology,45000,Roma,Mid
2,Luca,Verdi,28.0,5,Vendite,37000,Milano,Mid
3,Sara,Neri,40.0,12,Information Technology,62000,Roma,Senior
4,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino,Senior
5,Francesca,Ferrari,NaN,15,Human Resources,58000,Roma,Senior
6,Elena,Romano,34.0,8,Information Technology,52000,Milano,Mid
7,Simone,Gialli,30.0,4,Vendite,33000,Napoli,Junior
8,Valentina,Rossi,30.0,9,Vendite,32000,Napoli,Mid
9,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino,Senior
10,Anna,Bianchi,32.0,7,Vendite,45000,Milano,Mid
11,Sara,Bianchi,32.0,7,Vendite,25000,Roma,Mid
12,Sara,Romano,33.0,8,Information Technology,40000,Milano,Mid
13,Simone,Gialli,30.0,4,Vendite,33000,Napoli,Junior
14,Valentina,Rossi,30.0,12,Vendite,42000,Milano,Senior

3. Sostituisci i nomi dei dipartimenti con le seguenti abbreviazioni: Vendite -> 'VEN', Information Technology -> 'IT', Human Resources -> 'HR'. Quanti dipendenti ci sono per ogni dipartimento?

In [32]:
dip_acronyms = {
    'Vendite' : 'VEN',
    'Information Technology' : 'IT',
    'Human Resources' : 'HR'
}

data['Dipartimento'] = data['Dipartimento'].map(dip_acronyms)
data

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città
0,Marco,Rossi,NaN,2,VEN,30000,Milano
1,Anna,Bianchi,32.0,7,IT,45000,Roma
2,Luca,Verdi,28.0,5,VEN,37000,Milano
3,Sara,Neri,40.0,12,IT,62000,Roma
4,Giorgio,Rossi,45.0,20,HR,70000,Torino
5,Francesca,Ferrari,NaN,15,HR,58000,Roma
6,Elena,Romano,34.0,8,IT,52000,Milano
7,Simone,Gialli,30.0,4,VEN,33000,Napoli
8,Valentina,Rossi,30.0,9,VEN,32000,Napoli
9,Giorgio,Rossi,45.0,20,HR,70000,Torino
10,Anna,Bianchi,32.0,7,VEN,45000,Milano
11,Sara,Bianchi,32.0,7,VEN,25000,Roma
12,Sara,Romano,33.0,8,IT,40000,Milano
13,Simone,Gialli,30.0,4,VEN,33000,Napoli
14,Valentina,Rossi,30.0,12,VEN,42000,Milano

4. Crea un'altra colonna con i valori di età discretizzati in 5 gruppi, a quale gruppo di età appartiene la maggior parte dei dipendenti?

5. Sostituisci i valori mancanti della colonna età con il valore medio di età per i dipendenti dello stesso settore.

6. Verifica se, in media, lo stipendio di chi vive a Milano è superiore rispetto a quello di chi vive a Roma.